aws-samples/aws-stm32-ml-at-edge-accelerator/stm32/Middleware/ARM/trusted-firmware-m/platform/ext/target/cypress/psoc64/libs/mtb-pdl-cat1/drivers/source/cy_pra.c
    NVIC_EnableIRQ(intr.intrSrc);
#else
    /* Need to get this address in RAM, because there are use cases
    *  where this address is used but flash is not accessible
    */
    ipcPraBase = Cy_IPC_Drv_GetIpcBaseAddress(CY_IPC_CHAN_PRA);

    /* Check the version of the driver on the Cortex-M0+ side to match with this one */
    if (CY_PRA_STATUS_SUCCESS != Cy_PRA_SendCmd(CY_PRA_MSG_TYPE_VERSION_CHECK,
                                    (uint16_t) 0U,
                                    (uint32_t) CY_PRA_DRV_VERSION_MAJOR,
                                    (uint32_t) CY_PRA_DRV_VERSION_MINOR))
    {
        /* The PRA driver may not function as expected if different versions
        *  of the driver are on the Cortex-M0+ and Cortex-M4 sides, so halt device.
        */
        CY_HALT();
    }
#endif /* (CY_CPU_CORTEX_M0P) */
}


#if (CY_CPU_CORTEX_M0P) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_PRA_Handler
****************************************************************************//**
*
* The IPC interrupt handler on Cortex-M0+ core is called after there is a
* request from the Cortex-M4 core.
*
*******************************************************************************/
static void Cy_PRA_Handler(void)
{
    cy_stc_pra_msg_t msgLocal;
    cy_stc_pra_msg_t* msgRemote;

    /* Processes an internal command copy and updates the original value */
    msgRemote = (cy_stc_pra_msg_t *)Cy_IPC_Drv_ReadDataValue(Cy_IPC_Drv_GetIpcBaseAddress(CY_IPC_CHAN_PRA));

    msgLocal = *msgRemote;
    Cy_PRA_ProcessCmd(&msgLocal);
    *msgRemote = msgLocal;

    /* Clears the interrupt logic to detect a next interrupt */
    Cy_IPC_Drv_ClearInterrupt(Cy_IPC_Drv_GetIntrBaseAddr(CY_IPC_INTR_PRA), CY_PRA_IPC_NONE_INTR, CY_PRA_IPC_CHAN_INTR);

    (void) Cy_IPC_Drv_LockRelease(Cy_IPC_Drv_GetIpcBaseAddress(CY_IPC_CHAN_PRA), CY_PRA_IPC_NONE_INTR);
}


/*******************************************************************************
* Function Name: Cy_PRA_ProcessCmd
****************************************************************************//**
*
* Processes and executes the command on Cortex-M0+ which was received from
* the Cortex-M4 application.
*
* \param message cy_stc_pra_msg_t
*
*******************************************************************************/
static void Cy_PRA_ProcessCmd(cy_stc_pra_msg_t *message)
{
    static bool structInit = false;
    static cy_stc_pra_system_config_t structCpy = {0UL};

    CY_ASSERT_L1(NULL != message);


    switch (message->praCommand)
    {
        case CY_PRA_MSG_TYPE_REG32_CLR_SET:
            /* Reports an error if any of the following conditions is false:
            *  - A new value (message->praData2) has zeros in the write-protected fields
            *  - The register index is within the valid range.
            */
            if ((0U == (message->praData2 & regIndexToAddr[message->praIndex].writeMask)) &&
                (CY_PRA_REG_POLICY_WRITE_NONE != regIndexToAddr[message->praIndex].writeMask) &&
                (Cy_PRA_RegAccessRangeValid(message->praIndex)))
            {
                uint32_t tmp;

                tmp =  CY_GET_REG32(regIndexToAddr[message->praIndex].addr);

                tmp &= (message->praData1 | regIndexToAddr[message->praIndex].writeMask);
                tmp |= message->praData2;
                CY_SET_REG32(regIndexToAddr[message->praIndex].addr, tmp);
                message->praStatus = CY_PRA_STATUS_SUCCESS;
            }
            else
            {
                message->praStatus = CY_PRA_STATUS_ACCESS_DENIED;
            }
            break;

        case CY_PRA_MSG_TYPE_REG32_SET:
            /* Reports an error if any of the following conditions is false:
            *  - A new value (message->praData1) has zeros in the write-protected fields
            *  - The register index is within the valid range.
            */
            if ((0U == (message->praData1 & regIndexToAddr[message->praIndex].writeMask)) &&
                (CY_PRA_REG_POLICY_WRITE_NONE != regIndexToAddr[message->praIndex].writeMask) &&
                (Cy_PRA_RegAccessRangeValid(message->praIndex)))
            {
                uint32_t tmp;

                tmp =  CY_GET_REG32(regIndexToAddr[message->praIndex].addr);

                /* Clears the bits allowed to write */
                tmp &= regIndexToAddr[message->praIndex].writeMask;

                /* Sets the allowed bits based on the new value.
                *  The write-protected fields have zeros in the new value, so no additional checks needed
                */
                tmp |= message->praData1;
                CY_SET_REG32(regIndexToAddr[message->praIndex].addr, tmp);
                message->praStatus = CY_PRA_STATUS_SUCCESS;
            }
            else
            {
                message->praStatus = CY_PRA_STATUS_ACCESS_DENIED;
            }
            break;

        case CY_PRA_MSG_TYPE_REG32_GET:
            if (Cy_PRA_RegAccessRangeValid(message->praIndex))
            {
                message->praData1 = CY_GET_REG32(regIndexToAddr[message->praIndex].addr);
                message->praStatus = CY_PRA_STATUS_SUCCESS;
            }
            else
            {
                message->praStatus = CY_PRA_STATUS_ACCESS_DENIED;
            }
            break;

        case CY_PRA_MSG_TYPE_CM0_WAKEUP:
            message->praStatus = CY_PRA_STATUS_SUCCESS;
            break;

        case CY_PRA_MSG_TYPE_VERSION_CHECK:
            /* The PRA driver may not function as expected if different versions
            *  of the driver are on the Cortex-M0+ and Cortex-M4 sides.
            */
            if (((uint32_t) CY_PRA_DRV_VERSION_MAJOR == (message->praData1)) &&
                ((uint32_t) CY_PRA_DRV_VERSION_MINOR == (message->praData2)))
            {
                message->praStatus = CY_PRA_STATUS_SUCCESS;
            }
            else
            {
                message->praStatus = CY_PRA_STATUS_ERROR_PRA_VERSION;
            }
            break;

        case CY_PRA_MSG_TYPE_SYS_CFG_FUNC:
            CY_ASSERT_L1((cy_stc_pra_system_config_t *)(message->praData1) != NULL);

            if( NULL != (cy_stc_pra_system_config_t *)(message->praData1))
            {
                cy_en_sysclk_status_t sysClkStatus = CY_SYSCLK_SUCCESS;
                message->praStatus = CY_PRA_STATUS_SUCCESS;

                structCpy = *((cy_stc_pra_system_config_t *)(message->praData1));

                /* Resets clocks configuration to the default state during system reset - DRIVERS-495 */
                if (0u != Cy_SysLib_GetResetReason())
                {
                    message->praStatus = Cy_PRA_ClocksReset();
                }
                /* Resets clocks configuration and backup domain to default
                 * state during hardware reset (POR, XRES, BOD)
                 */
                else if (!structInit)
                {
                    /* Resets the Backup domain on POR, XRES, BOD only if Backup domain is supplied by VDDD */
                    if ((structCpy.vBackupVDDDEnable) && (structCpy.iloEnable))
                    {
                        message->praStatus = Cy_PRA_BackupReset(structCpy.iloHibernateON);
                    }
                    message->praStatus = Cy_PRA_ClocksReset();
                }
                else
                {
                    /* Skip clock clocks configuration resetting */
                }

                CY_MISRA_FP_LINE('MISRA C-2012 Rule 14.3','Checked manually, condition evaluates true.');
                if (CY_SYSCLK_SUCCESS == sysClkStatus)
                {
                    message->praStatus = Cy_PRA_SystemConfig(&structCpy);
                }

                if((!structInit) && (CY_PRA_STATUS_SUCCESS == message->praStatus))
                {
                    structInit = true;
                }
            }
            else
            {
                message->praStatus = CY_PRA_STATUS_INVALID_PARAM;
            }
            break;

        case CY_PRA_MSG_TYPE_SECURE_ONLY:
            switch (message->praIndex)
            {
                case CY_PRA_PM_FUNC_HIBERNATE:
                    Cy_PRA_PmHibernate(message->praData1);
                    message->praStatus = CY_PRA_STATUS_SUCCESS;
                    break;

                case CY_PRA_PM_FUNC_CM4_DP_FLAG_SET:
                    Cy_PRA_PmCm4DpFlagSet();
                    message->praStatus = CY_PRA_STATUS_SUCCESS;
                    break;

                case CY_PRA_CLK_FUNC_DS_BEFORE_TRANSITION:
                    message->praStatus = Cy_PRA_ClkDSBeforeTransition();
                    break;

                case CY_PRA_CLK_FUNC_DS_AFTER_TRANSITION:
                    message->praStatus = Cy_PRA_ClkDSAfterTransition();
                    break;

                case CY_PRA_PM_FUNC_BUCK_ENABLE_VOLTAGE2:
                    Cy_SysPm_BuckEnableVoltage2();
                    message->praStatus = CY_PRA_STATUS_SUCCESS;
                    break;

