aws-samples/aws-stm32-ml-at-edge-accelerator/stm32/Middleware/ARM/trusted-firmware-m/platform/ext/target/cypress/psoc64/libs/mtb-pdl-cat1/drivers/source/cy_pra.c
                        retVal = CY_PRA_STATUS_SUCCESS;
                    }
                }
            }
        }
    }
    else if (Cy_SysClk_FllIsEnabled())
    {
        /* The timeout waits for FLL to regain a lock */
        while ((!Cy_SysClk_FllLocked()) && (0UL != timeout))
        {
            timeout--;
        }

        if (0UL != timeout)
        {
            /* Undoes the bypass for FLL */
            CY_REG32_CLR_SET(SRSS_CLK_FLL_CONFIG3, SRSS_CLK_FLL_CONFIG3_BYPASS_SEL, CY_SYSCLK_FLLPLL_OUTPUT_OUTPUT);
            retVal = CY_PRA_STATUS_SUCCESS;
        }
    }
    else
    {
        retVal = CY_PRA_STATUS_SUCCESS;
    }

    return (retVal);
}

/*******************************************************************************
* Function Name: Cy_PRA_RegAccessRangeValid
****************************************************************************//**
*
* Checks if the access is within the valid range and the access address is non-zero.
*
* \param index The index of the accessed register.
*
* \return Returns true for the valid access.
*
*******************************************************************************/
static bool Cy_PRA_RegAccessRangeValid(uint16_t index)
{
    bool accessValid = true;

    /* Checks if access is within the array range */
    if (index >= CY_PRA_REG_INDEX_COUNT)
    {
        accessValid = false;
    }
    else
    {
        /* Some registers do not exist for some families */
        if (regIndexToAddr[index].addr == (const volatile uint32_t *) 0U)
        {
            accessValid = false;
        }
    }

    return accessValid;
}


/*******************************************************************************
* Function Name: Cy_PRA_ClocksReset
****************************************************************************//**
*
* Initializes system clocks and dividers to the default state after reset.
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ClocksReset(void)
{
    cy_en_pra_status_t returnStatus = CY_PRA_STATUS_SUCCESS;
    cy_en_sysclk_status_t sysClkStatus = CY_SYSCLK_SUCCESS;

    /* Sets the worst case memory wait states (! ultra low power, 150 MHz) */
    Cy_SysLib_SetWaitStates(false, CY_PRA_150MHZ_FREQUENCY);

    /* Resets the core clock path to default and disable all the FLLs/PLLs after Reset or Software reset */
    sysClkStatus = Cy_SysClk_ClkHfSetDivider(CY_PRA_CLKHF_0, CY_SYSCLK_CLKHF_NO_DIVIDE);
    if (CY_SYSCLK_SUCCESS != sysClkStatus)
    {
        returnStatus = CY_PRA_STATUS_ERROR_PROCESSING_CLKHF0;
    }

    /* Sets the default divider for FAST, PERI and SLOW clocks */
    Cy_SysClk_ClkFastSetDivider(CY_PRA_DIVIDER_0);
    Cy_SysClk_ClkPeriSetDivider(CY_PRA_DIVIDER_1);
    Cy_SysClk_ClkSlowSetDivider(CY_PRA_DIVIDER_0);

    SystemCoreClockUpdate();

    /* Disables All PLLs */
    if (CY_SRSS_NUM_PLL >= CY_PRA_CLKPLL_1)
    {
        sysClkStatus = Cy_SysClk_PllDisable(CY_PRA_CLKPLL_1);
    }

    if (CY_SYSCLK_SUCCESS != sysClkStatus)
    {
        returnStatus = CY_PRA_STATUS_ERROR_PROCESSING_PLL0;
    }

    if (CY_SRSS_NUM_PLL >= CY_PRA_CLKPLL_2)
    {
        sysClkStatus = Cy_SysClk_PllDisable(CY_PRA_CLKPLL_2);
    }

    if (CY_SYSCLK_SUCCESS != sysClkStatus)
    {
        returnStatus = CY_PRA_STATUS_ERROR_PROCESSING_PLL1;
    }

    /* Sets the CLK_PATH1 source to IMO */
    sysClkStatus = Cy_SysClk_ClkPathSetSource((uint32_t) CY_SYSCLK_CLKHF_IN_CLKPATH1, CY_SYSCLK_CLKPATH_IN_IMO);
    if (CY_SYSCLK_SUCCESS != sysClkStatus)
    {
        returnStatus = CY_PRA_STATUS_ERROR_PROCESSING_PATHMUX1;
    }

    /* Set the HF0 source to IMO if it is sourced from WCO */
    if (CY_SYSCLK_CLKHF_IN_CLKPATH0 == Cy_SysClk_ClkHfGetSource(CY_PRA_CLKHF_0))
    {
            if (CY_SYSCLK_CLKPATH_IN_WCO == Cy_SysClk_ClkPathGetSource((uint32_t) CY_SYSCLK_CLKHF_IN_CLKPATH0))
            {
                sysClkStatus = Cy_SysClk_ClkHfSetSource(CY_PRA_CLKHF_0, CY_SYSCLK_CLKHF_IN_CLKPATH1);
                if (CY_SYSCLK_SUCCESS != sysClkStatus)
                {
                    returnStatus = CY_PRA_STATUS_ERROR_PROCESSING_CLKHF0;
                }
                SystemCoreClockUpdate();
            }
    }

    sysClkStatus = Cy_SysClk_FllDisable();
    if (CY_SYSCLK_SUCCESS != sysClkStatus)
    {
        returnStatus = CY_PRA_STATUS_ERROR_PROCESSING_FLL0;
    }

    /* Sets the CLK_PATH0 source to IMO */
    sysClkStatus = Cy_SysClk_ClkPathSetSource((uint32_t) CY_SYSCLK_CLKHF_IN_CLKPATH0, CY_SYSCLK_CLKPATH_IN_IMO);
    if (CY_SYSCLK_SUCCESS != sysClkStatus)
    {
        returnStatus = CY_PRA_STATUS_ERROR_PROCESSING_PATHMUX0;
    }

    /* Sets the HF0 source to IMO via CLK_PATH0 */
    sysClkStatus = Cy_SysClk_ClkHfSetSource(CY_PRA_CLKHF_0, CY_SYSCLK_CLKHF_IN_CLKPATH0);
    if (CY_SYSCLK_SUCCESS != sysClkStatus)
    {
        returnStatus = CY_PRA_STATUS_ERROR_PROCESSING_CLKHF0;
    }

    #ifdef CY_IP_MXBLESS
        Cy_BLE_EcoReset();
    #endif

    return returnStatus;
}


/*******************************************************************************
* Function Name: Cy_PRA_BackupReset
****************************************************************************//**
*
* Resets the Backup domain and system clocks after System reset.
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_BackupReset(bool iloHibernateON)
{
    cy_en_pra_status_t returnStatus = CY_PRA_STATUS_SUCCESS;

    if (CY_SYSLIB_SUCCESS != Cy_SysLib_ResetBackupDomain())
    {
        returnStatus = CY_PRA_STATUS_ERROR_PROCESSING_PWR;
    }
    else
    {
        if (Cy_SysClk_IloIsEnabled())
        {
            if (CY_SYSCLK_SUCCESS != Cy_SysClk_IloDisable())
            {
                returnStatus = CY_PRA_STATUS_ERROR_PROCESSING_PWR;
            }
        }

        if (CY_PRA_STATUS_SUCCESS == returnStatus)
        {
            Cy_SysClk_IloEnable();
            Cy_SysClk_IloHibernateOn(iloHibernateON);
        }
    }

    return returnStatus;
}

#endif /* (CY_CPU_CORTEX_M0P) */

#endif /* (CY_DEVICE_SECURE) */


/* [] END OF FILE */
